#include<iostream>
#include<algorithm>

using namespace std;

//테트로미노 5가지
//완전탐색
//총 13가지?
//좌표가 넘어가도 결과값에 변화가 없게 모두 0으로 초기화 시켜놓으면 된다
//**대칭도 된다

int N, M;		//세로 , 가로
int arr[600][600];
int answer = 0;

pair<int, int> p[19][4] = {
	{{0,0},{0,1},{0,2},{0,3}},
	{{0,0},{1,0},{2,0},{3,0}},
	{{0,0},{0,1},{1,0},{1,1}},
	{{0,0},{1,0},{2,0},{2,1}},
	{{0,0},{0,1},{0,2},{1,0}},
	{{0,0},{0,1},{1,1},{2,1}},
	{{0,0},{0,1},{0,2},{-1,2}},
	{{0,0},{1,0},{2,0},{0,1}},
	{{0,0},{1,0},{2,0},{2,-1}},
	{{0,0},{1,0},{1,1},{2,1}},
	{{0,0},{0,1},{-1,1},{-1,2}},
	{{0,0},{1,0},{1,-1},{2,-1}},
	{{0,0},{0,1},{0,2},{1,1}},
	{{0,0},{1,0},{2,0},{1,-1}},
	{{0,0},{0,1},{0,2},{-1,1}},
	{{0,0},{1,0},{2,0},{1,1}},
	{{0,0},{0,1},{0,2},{1,2}},
	{{0,0},{1,0},{1,1},{1,2}},
	{{0,0},{0,1},{1,1},{1,2}}
};

void find(int n, int m) {
	int tmp = 0;
	
	for (int i = 0; i < 19; i++) {
		tmp = 0;
		for (int j = 0; j < 4; j++) {
			int newx = n + p[i][j].first;
			int newy = m + p[i][j].second;
			tmp += arr[newx][newy];
		}
		answer = max(answer, tmp);
	}
}

int main() {
	int N, M;

	cin >> N >> M;

	for (int n = 1; n <= N; n++) {
		for (int m = 1; m <= M; m++) {
			cin >> arr[n][m];
		}
	}

	for (int n = 1; n <= N; n++) {
		for (int m = 1; m <= M; m++) {
			find(n, m);
		}
	}

	cout << answer;
}
